PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f87j72.inc
;----- INTCON2 Bits -----------------------------------------------------
RBIP             EQU  H'0000'
INT3IP           EQU  H'0001'
TMR0IP           EQU  H'0002'
INTEDG3          EQU  H'0003'
INTEDG2          EQU  H'0004'
INTEDG1          EQU  H'0005'
INTEDG0          EQU  H'0006'
NOT_RBPU         EQU  H'0007'

INT3P            EQU  H'0001'
T0IP             EQU  H'0002'
RBPU             EQU  H'0007'


;----- INTCON Bits -----------------------------------------------------
RBIF             EQU  H'0000'
INT0IF           EQU  H'0001'
TMR0IF           EQU  H'0002'
RBIE             EQU  H'0003'
INT0IE           EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE_GIEL        EQU  H'0006'
GIE_GIEH         EQU  H'0007'

INT0F            EQU  H'0001'
T0IF             EQU  H'0002'
INT0E            EQU  H'0004'
T0IE             EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

GIEL             EQU  H'0006'
GIEH             EQU  H'0007'


;----- STKPTR Bits -----------------------------------------------------
STKUNF           EQU  H'0006'
STKFUL           EQU  H'0007'

SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'
STKOVF           EQU  H'0007'

STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0F6B'
       __BADRAM  H'0F71'
       __BADRAM  H'0F77'
       __BADRAM  H'0F7D'
       __BADRAM  H'0F87'-H'0F88'
       __BADRAM  H'0F90'-H'0F91'
       __BADRAM  H'0F99'-H'0F9A'
       __BADRAM  H'0F9C'
       __BADRAM  H'0FB0'
       __BADRAM  H'0FBA'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   Watchdog Timer:
;     WDTEN = OFF          Disabled-Controlled by SWDTEN bit
;     WDTEN = ON           Enabled
;
;   Stack Overflow Reset:
;     STVREN = OFF         Disabled
;     STVREN = ON          Enabled
;
;   Extended Instruction Set Enable bit:
;     XINST = OFF          Disabled
;     XINST = ON           Enabled
;
;   Code Protect:
;     CP0 = ON             Enabled
;     CP0 = OFF            Disabled
;
;   Oscillator Selection bits:
;     OSC = INTOSC         Internal oscillator, port function on RA6 and RA7 
;     OSC = INTOSCPLL      INTOSC with PLL enabled, port function on RA6 and RA7
;     OSC = INTOSCO        Internal oscillator, CLKOUT on RA6 and port function on RA7
;     OSC = INTOSCPLLO     INTOSC with PLL enabled, CLKOUT on RA6 and port function on RA7
;     OSC = HS             HS oscillator
;     OSC = HSPLL          HS oscillator, PLL enabled
;     OSC = EC             EC Oscillator with clock out on RA6
;     OSC = ECPLL          EC Oscillator with PLL
;
;   Secondary Clock Source T1OSCEN Enforcement:
;     T1DIG = OFF          Secondary Oscillator clock source may not be selected
;     T1DIG = ON           Secondary Oscillator clock source may be selected
;
;   Low-Power Timer1 Oscillator Enable bit:
;     LPT1OSC = ON         Timer1 oscillator configured for low-power operation
;     LPT1OSC = OFF        Timer1 oscillator configured for higher power operation
;
;   Fail-Safe Clock Monitor Enable bit:
;     FCMEN = OFF          Fail-Safe Clock Monitor disabled
;     FCMEN = ON           Fail-Safe Clock Monitor enabled
;
;   Two-Speed Start-up (Internal/External Oscillator Switchover) Control bit:
;     IESO = OFF           Two-Speed Start-up disabled
;     IESO = ON            Two-Speed Start-up enabled
;
;   Watchdog Timer Postscaler Select bits:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   RTCC Reference Clock Select bit:
;     RTCSOSC = INTOSCREF  RTCC uses INTOSC/INTRC as reference clock
;     RTCSOSC = T1OSCREF   RTCC uses T1OSC/T1CKI as reference clock
;
;   CCP2 MUX:
;     CCP2MX = ALTERNATE   RE7 <Microcontroller> / RB3
;     CCP2MX = DEFAULT     RC1
;
;==========================================================================
;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'


        LIST
